# 100세 계획 프로그램

print(" !! 100세 시대 !!")
print(" 나는 어떤 모습일까요? ")
print()

age = int(input("현재 나이를 입력해주세요 >>> "))
print("여기까지 달려왔어요.")
print("*" * age, end='')
print("_" * (100-age))

print()
print("세상은 넓고, 우리에겐 수많은 기회와 새로운 도전들이 기다리고 있습니다.")
print('보다 지혜롭고, 보다 풍부한 경험을 지닌 100세의 나 자신을 위해 한 걸음씩 내디뎌 보세요')

print()
print('지금부터')
print('='*50)
print(f'일년에 한번씩 새로운 취미 만들기에 도전한다면 {100-age}개의 새로운 도전이 기다리고 있어요.')
print(f'한달에 한번씩 여행을 간다면 {(100-age)*12 :,}곳에서 추억을 쌓을 수 있어요.')
print(f'일주일에 한권씩 책을 읽는다면 {(100-age)*12*4 :,}권의 책을 읽을 수 있어요')
print(f'하루에 1개의 영어단어를 외운다면 {(100-age)*365 :,}개의 영어 단어를 익히실 수 있어요.')
print('='*50)
print('계획을 세우고 그 꿈을 위해 한 걸음,한 걸음씩 내디뎌 보세요.')